//
// dungeon crawl 日本語版より
//
run_away_list=new Array("降参しろ","失せろ","立ち去れ","逃げるがいい","退き下がれ","飛んで逃げろ","バカ面下げて失せろ","クセえんだよ失せろ","行っちまえ。戻ってくんな","死んじまえ","汝よ退け","汝よ立ち去れ","尻尾を巻いて逃げるがいい","去れ","汝の来たりし処に帰れ","今すぐ失せろ！","逝っちまえ","くたばれ","這いずって失せろ","這いずって引き返せ","這いずれ","這って帰れ","とっとと引き返せ","とっとと消えろ","とっとと失せろ","慌てて逃げるがいい","こそこそ逃げてくがいい");

give_up_list=new Array("諦めろ","降参しろ","止まれ","降伏しろ","跪け","慈悲を乞え","絶望しろ","服従しろ","屈服しろ","怖じ気づけ","汝の過ちを認めよ","汝の挫折を認めよ","汝の運命を認めよ","降伏せよ","服従せよ","汝の失敗を受け容れよ","汝の挫折を受け容れよ","汝の運命を受け容れよ","抵抗をやめろ","震え上がれ","希望を棄てよ","敗北を噛み締めろ","うなだれろ","その身を棄てよ","望みを棄てよ","汝の鎮魂歌を聴け","汝の遁走曲を聴け","敗北を認めろ","もがき苦しめ");

insults1_list=new Array("不細工な","へまな","下劣な","ベタベタな","役立たずな","尊大な","口先だけで","不作法な","甘ったれた","とんまな","意気地なしな","卑しい","気色悪い","しらばくれた","退屈な","無責任な","変態で","卑屈な","無気力な","腰抜けな","嘘吐きな","にやけた","つむじ曲がりな","薄っぺらな","しつこい","ペテン吐きな","助平な","たるんだ","垢じみた","おぞましい","憎むべき","出しゃばりな","病気持ちで","癇に障る","強情張りな","のろまな","どもりで","ひしゃげた","めそめそした","いやらしい","太鼓腹で","臆病な","むかつく","ちんけな","竦み上がった","震え上がった","プンプン臭う","ポン引きで","猫かぶりで","尾羽打ち枯らした","底が浅い","梅毒持ちで","酔いどれで","無教養な","にやけた","スカスカな","ムッツリで","よろよろで","ひねくれた","お世辞屋で","トチ狂った","口の減らない","見栄張りな","嫌たらしい","極悪非道な","ひがみっぽい","わがままな","貧弱な","無価値な","ふざけた");

insults2_list=new Array("ご機嫌取りの","鳥刺しの","阿呆の","痴呆の","短気性の","鉤爪持ちの","低能の","キス魔の","クルクルパーの","鬱病の","ドブ産まれの","乱視の","冷血漢の","いけ好かない","社会の敵の","エルフ殺しの","腎肥大の","泥啜りの","垂れ唇の","蝿たかりの","左巻きの","天然馬鹿の","馬鹿食いの","内臓病みの","ぴいぴいの","短絡思考の","下賎の","憎まれっ子の","うわごと言いの","粗忽者の","がさつ者の","ゲテモノの","精神錯乱の","びっこの","小心者の","月狂いの","道化の","泣き虫の","人でなしの","不埒者の","カビだらけの","発情期の","告げ口屋の","厚顔無知の","かっぱらいの","癇癪魔の","薄バカの","野育ちの","カスの","木っ端の","万引きの","ブス専の","家畜の","腹ボテの","鈍足の","呑兵衛の","ヒキガエルの","たかり屋の","豚鼻の","けちの","害虫の");

insults3_list=new Array("萎び野郎","邪魔者","ひったくり","偏執狂","物乞い","いびり屋","イノブタ","食わせ者","化け物","浮浪者","ド腐れ","おしゃべり","だんまり屋","ボッキ野郎","気取り屋","玉袋","死に損ない","しみったれ","とんま","浮かれ野郎","淫売","お調子者","べんちゃら野郎","ほら吹き","甘えたガキ","三下","カモ","よた公","やせっぽち","業突く張り","豚公","ケダモノ","こそ泥","脳たりん","下劣漢","田舎者","蛆虫","害虫","デク人形","貧弱野郎","物乞い","クソガキ","金づち頭","クソ","名無し","クズ","薄のろ","豚の餌","ニキビ野郎","イボ野郎","ハゲタカ","ぼんくら","害悪","ゴミあさり","若造","奴隷野郎","間抜け","ゴロツキ","スライムモルド","盗っ人","空威張り野郎","売女","山師","無宿者","ちびすけ","悪ガキ","悪党","下僕","ハゲワシ","ろくでなし","ごますり","生白野郎","ナメクジ野郎","ヤクの糞","ゾンビのエサ");

function taunt0()
{
 if (Math.floor(Math.random()*3)) {
  return (give_up_list[Math.floor(Math.random()*give_up_list.length)]);
 } else {
  return (run_away_list[Math.floor(Math.random()*run_away_list.length)]);
 }
}

function taunt1()
{
 return insults1_list[Math.floor(Math.random()*insults1_list.length)];
}

function taunt2()
{
 return insults2_list[Math.floor(Math.random()*insults2_list.length)];
}
function taunt3()
{
 return insults3_list[Math.floor(Math.random()*insults3_list.length)];
}

kusousers = "FKNZAP:shineshinesun:KyouKiGaTaranai:DarkGod".split(":");
function tauntname()
{
 return kusousers[Math.floor(Math.random()*kusousers.length)];
}

